docs: update docs/architecture.md, use mermaid instead of ASCII flow chart
